import { CalendarComponent } from './calendar.component';

export class CalendarConstants {
    public static get ukr() {
        return {
            dayNames: ['Неділя', 'Понеділок', 'Вівторок', 'Середа', 'Четвер', 'Пятниця', 'Субота'],
            dayNamesShort: ['Нед', 'Пон', 'Вівт', 'Сер', 'Чет', 'Пят', 'Суб'],
            dayNamesMin: ['Нд', 'Пн', 'Вт', 'Ср', 'Чт', 'Пт', 'Сб'],
            monthNames: ['Січень', 'Лютий', 'Березень', 'Квітень', 'Травень', 'Червень', 'Липень', 'Серпень', 'Вересень', 'Жовтень', 'Листопад', 'Грудень'],    		
            monthNamesShort: [ 'Січ', 'Лют', 'Бер', 'Квіт', 'Трав', 'Черв', 'Лип', 'Серп', 'Вер', 'Жовт', 'Лист', 'Груд' ]
        };
    }
}
